# 努力学习编程的小垃圾
# 不好好学就是废物
# 学习时间：2021/8/24  19:01

#and 且
#del 删除变量
#from 从某一个库中或者文件读取
#not 非
#while while——loop关键字，后跟循环条件
#as 通常和import类叠加使用，代表以某个其他名称加载某个模块
#elif if分支控制的一部分
#global 声明一个变量为全局变量
#or 或
#with 执行一个动作，通常和as一起使用，使用with后，完成动作后，必定关闭或者退出
#assert 声明一个错误。使用方法：assert后跟布尔运算
#else  if分支控制的一部分，代表其他条件不成立时的状况
#if  if控制分支
#pass 用来占座
#yield 迭代器生成器
#break 停止循环的一种方法，在while，for循环中使用
#except  try调试方法的一个异常捕获方法
#import 引入module
#print 输出
#class 声明一个类
#exec 把后面的内容重新执行，exec("print 'hello world'"),可以作为命令重构。例如把获取变量作为变量等
#in 检查一个元素是否在一个列表、元组、字典中。在字典中，一般检查的是key
#raise 抛出一个自定义的异常
#continue 继续循环，而不进行后续步骤
#finally try调试时的最终执行
#is 判断两个对象的ID是否一致
#return 通常用于返回函数体内，可以通过赋值捕获
#def 定义一个函数
#for-loop for循环
#lambda：一个表达式的书写方法，其主体是一个表达式
#try 尝试


# %c 转换成字符（ASCII 码值，或者长度为一的字符串）
# %r 优先用repr()函数进行字符串转换
# %s 优先用str()函数进行字符串转换
# %d / %i 转成有符号十进制数
# %u 转成无符号十进制数
# %o 转成无符号八进制数
# %x / %X 转成无符号十六进制数（x / X 代表转换后的十六进制字符的大小写）
# %e / %E 转成科学计数法（e / E控制输出e / E）
# %f / %F 转成浮点数（小数部分自然截断）
# %g / %G  %E和%F 的简写
# %% 输出% （格式化字符串里面包括百分号，那么必须使用%%）

